{
  "timestamp": "2026-02-11T09:53:17.230018",
  "news": [
    {
      "title": "North Korea-Linked UNC1069 Uses AI Lures to Attack Cryptocurrency Organizations",
      "link": "https://thehackernews.com/2026/02/north-korea-linked-unc1069-uses-ai.html",
      "description": "The North Korea-linked threat actor known as UNC1069 has been observed targeting the cryptocurrency sector to steal sensitive data from Windows and macOS systems with the ultimate goal of facilitating financial theft.\n\"The intrusion relied on a social engineering scheme involving a compromised Telegram account, a fake Zoom meeting, a ClickFix infection vector, and reported usage of AI-generated",
      "date": "Wed, 11 Feb 2026 12:20:00 +0530",
      "category": "cybersecurity_news",
      "source": "https://feeds.feedburner.com/TheHackersNews"
    },
    {
      "title": "DPRK Operatives Impersonate Professionals on LinkedIn to Infiltrate Companies",
      "link": "https://thehackernews.com/2026/02/dprk-operatives-impersonate.html",
      "description": "The information technology (IT) workers associated with the Democratic People's Republic of Korea (DPRK) are now applying to remote positions using real LinkedIn accounts of individuals they're impersonating, marking a new escalation of the fraudulent scheme.\n\"These profiles often have verified workplace emails and identity badges, which DPRK operatives hope will make their fraudulent",
      "date": "Tue, 10 Feb 2026 23:14:00 +0530",
      "category": "cybersecurity_news",
      "source": "https://feeds.feedburner.com/TheHackersNews"
    },
    {
      "title": "Reynolds Ransomware Embeds BYOVD Driver to Disable EDR Security Tools",
      "link": "https://thehackernews.com/2026/02/reynolds-ransomware-embeds-byovd-driver.html",
      "description": "Cybersecurity researchers have disclosed details of an emergent ransomware family dubbed Reynolds that comes embedded with a built-in bring your own vulnerable driver (BYOVD) component for defense evasion purposes within the ransomware payload itself.\nBYOVD refers to an adversarial technique that abuses legitimate but flawed driver software to escalate privileges and disable Endpoint Detection",
      "date": "Tue, 10 Feb 2026 20:06:00 +0530",
      "category": "cybersecurity_news",
      "source": "https://feeds.feedburner.com/TheHackersNews"
    },
    {
      "title": "From Ransomware to Residency: Inside the Rise of the Digital Parasite",
      "link": "https://thehackernews.com/2026/02/from-ransomware-to-residency-inside.html",
      "description": "Are ransomware and encryption still the defining signals of modern cyberattacks, or has the industry been too fixated on noise while missing a more dangerous shift happening quietly all around them?\nAccording to Picus Labs’ new Red Report 2026, which analyzed over 1.1 million malicious files and mapped 15.5 million adversarial actions observed across 2025, attackers are no longer optimizing for",
      "date": "Tue, 10 Feb 2026 19:29:00 +0530",
      "category": "cybersecurity_news",
      "source": "https://feeds.feedburner.com/TheHackersNews"
    },
    {
      "title": "Fortinet Patches Critical SQLi Flaw Enabling Unauthenticated Code Execution",
      "link": "https://thehackernews.com/2026/02/fortinet-patches-critical-sqli-flaw.html",
      "description": "Fortinet has released security updates to address a critical flaw impacting FortiClientEMS that could lead to the execution of arbitrary code on susceptible systems.\nThe vulnerability, tracked as CVE-2026-21643, has a CVSS rating of 9.1 out of a maximum of 10.0.\n\n\"An improper neutralization of special elements used in an SQL Command ('SQL Injection') vulnerability [CWE-89] in FortiClientEMS may",
      "date": "Tue, 10 Feb 2026 19:00:00 +0530",
      "category": "cybersecurity_news",
      "source": "https://feeds.feedburner.com/TheHackersNews"
    },
    {
      "title": "ZAST.AI Raises $6M Pre-A to Scale \"Zero False Positive\" AI-Powered Code Security",
      "link": "https://thehackernews.com/2026/02/zastai-raises-6m-pre-to-scale-zero.html",
      "description": "January 5, 2026, Seattle, USA — ZAST.AI announced the completion of a $6 million Pre-A funding round. This investment came from the well-known investment firm Hillhouse Capital, bringing ZAST.AI's total funding close to $10 million. This marks a recognition from leading capital markets of a new solution: ending the era of high false positive rates in security tools and making every alert",
      "date": "Tue, 10 Feb 2026 17:10:00 +0530",
      "category": "cybersecurity_news",
      "source": "https://feeds.feedburner.com/TheHackersNews"
    },
    {
      "title": "Warlock Ransomware Breaches SmarterTools Through Unpatched SmarterMail Server",
      "link": "https://thehackernews.com/2026/02/warlock-ransomware-breaches.html",
      "description": "SmarterTools confirmed last week that the Warlock (aka Storm-2603) ransomware gang breached its network by exploiting an unpatched SmarterMail instance.\nThe incident took place on January 29, 2026, when a mail server that was not updated to the latest version was compromised, the company's Chief Commercial Officer, Derek Curtis, said.\n\"Prior to the breach, we had approximately 30 servers/VMs",
      "date": "Tue, 10 Feb 2026 15:54:00 +0530",
      "category": "cybersecurity_news",
      "source": "https://feeds.feedburner.com/TheHackersNews"
    },
    {
      "title": "Dutch Authorities Confirm Ivanti Zero-Day Exploit Exposed Employee Contact Data",
      "link": "https://thehackernews.com/2026/02/dutch-authorities-confirm-ivanti-zero.html",
      "description": "The Netherlands' Dutch Data Protection Authority (AP) and the Council for the Judiciary confirmed both agencies (Rvdr) have disclosed that their systems were impacted by cyber attacks that exploited the recently disclosed security flaws in Ivanti Endpoint Manager Mobile (EPMM), according to a notice sent to the country's parliament on Friday.\n\"On January 29, the National Cyber Security Center (",
      "date": "Tue, 10 Feb 2026 13:52:00 +0530",
      "category": "cybersecurity_news",
      "source": "https://feeds.feedburner.com/TheHackersNews"
    },
    {
      "title": "China-Linked UNC3886 Targets Singapore Telecom Sector in Cyber Espionage Campaign",
      "link": "https://thehackernews.com/2026/02/china-linked-unc3886-targets-singapore.html",
      "description": "The Cyber Security Agency (CSA) of Singapore on Monday revealed that the China-nexus cyber espionage group known as UNC3886 targeted its telecommunications sector.\n\"UNC3886 had launched a deliberate, targeted, and well-planned campaign against Singapore's telecommunications sector,\" CSA said. \"All four of Singapore's major telecommunications operators ('telcos') – M1, SIMBA Telecom, Singtel, and",
      "date": "Mon, 09 Feb 2026 22:31:00 +0530",
      "category": "cybersecurity_news",
      "source": "https://feeds.feedburner.com/TheHackersNews"
    },
    {
      "title": "SolarWinds Web Help Desk Exploited for RCE in Multi-Stage Attacks on Exposed Servers",
      "link": "https://thehackernews.com/2026/02/solarwinds-web-help-desk-exploited-for.html",
      "description": "Microsoft has revealed that it observed a multi‑stage intrusion that involved the threat actors exploiting internet‑exposed SolarWinds Web Help Desk (WHD) instances to obtain initial access and move laterally across the organization's network to other high-value assets.\nThat said, the Microsoft Defender Security Research Team said it's not clear whether the activity weaponized recently",
      "date": "Mon, 09 Feb 2026 20:12:00 +0530",
      "category": "cybersecurity_news",
      "source": "https://feeds.feedburner.com/TheHackersNews"
    },
    {
      "title": "Asia Fumbles With Throttling Back Telnet Traffic in Region",
      "link": "https://www.darkreading.com/threat-intelligence/asia-fumbles-telnet-threat-traffic",
      "description": "Only Taiwan made the top 10 list of governments, effectively blocking the threat-ridden protocol, but overall the region lagged in curbing Telnet traffic.",
      "date": "Wed, 11 Feb 2026 02:00:00 GMT",
      "category": "cybersecurity_news",
      "source": "https://www.darkreading.com/rss.xml"
    },
    {
      "title": "SolarWinds WHD Attacks Highlight Risks of Exposed Apps",
      "link": "https://www.darkreading.com/vulnerabilities-threats/solarwinds-whd-attacks-exposed-apps",
      "description": "Organizations that have exposed their instances of Web Help Desk to the public Internet have inadvertently made them prime targets for attackers.",
      "date": "Tue, 10 Feb 2026 22:00:53 GMT",
      "category": "cybersecurity_news",
      "source": "https://www.darkreading.com/rss.xml"
    },
    {
      "title": "In Bypassing MFA, ZeroDayRAT Is 'Textbook Stalkerware'",
      "link": "https://www.darkreading.com/threat-intelligence/zerodayrat-brings-commercial-spyware-to-mass-market",
      "description": "With access to SIM, location data, and a preview of recent SMSes, attackers have everything they need for account takeover or targeted social engineering.",
      "date": "Tue, 10 Feb 2026 21:37:15 GMT",
      "category": "cybersecurity_news",
      "source": "https://www.darkreading.com/rss.xml"
    },
    {
      "title": "Microsoft Patches 6 Actively Exploited Zero-Days",
      "link": "https://www.darkreading.com/vulnerabilities-threats/microsoft-fixes-6-actively-exploited-zero-days",
      "description": "Three of those zero-days are security feature bypass flaws, which give attackers a way to slip past built-in protections in multiple Microsoft products.",
      "date": "Tue, 10 Feb 2026 21:00:36 GMT",
      "category": "cybersecurity_news",
      "source": "https://www.darkreading.com/rss.xml"
    },
    {
      "title": "OT Attacks Get Scary With 'Living-off-the-Plant' Techniques",
      "link": "https://www.darkreading.com/ics-ot-security/ot-attacks-living-off-the-plant",
      "description": "Ironically, security by obscurity has helped prevent dangerous OT attacks in recent years. It won't be that way forever.",
      "date": "Tue, 10 Feb 2026 16:14:29 GMT",
      "category": "cybersecurity_news",
      "source": "https://www.darkreading.com/rss.xml"
    },
    {
      "title": "TransUnion's Real Networks Deal Focuses on Robocall Blocking",
      "link": "https://www.darkreading.com/cyber-risk/transunion-s-real-networks-deal-focuses-on-robocall-blocking",
      "description": "The acquisition allows the credit reporting agency to add SMS spam and scam prevention to its robocall blocking capabilities.",
      "date": "Mon, 09 Feb 2026 23:05:21 GMT",
      "category": "cybersecurity_news",
      "source": "https://www.darkreading.com/rss.xml"
    },
    {
      "title": "Warlock Gang Breaches SmarterTools Via SmarterMail Bugs",
      "link": "https://www.darkreading.com/application-security/warlock-gang-breaches-smartertools-smartermail-bugs",
      "description": "The ransomware group breached SmarterTools through a vulnerability in the company's own SmarterMail product.",
      "date": "Mon, 09 Feb 2026 21:59:02 GMT",
      "category": "cybersecurity_news",
      "source": "https://www.darkreading.com/rss.xml"
    },
    {
      "title": "TeamPCP Turns Cloud Infrastructure Into Crime Bots",
      "link": "https://www.darkreading.com/cloud-security/teampcp-cloud-infrastructure-crime-bots",
      "description": "The threat actor has been compromising cloud environments at scale with automated worm-like attacks on exposed services and interfaces.",
      "date": "Mon, 09 Feb 2026 21:14:34 GMT",
      "category": "cybersecurity_news",
      "source": "https://www.darkreading.com/rss.xml"
    },
    {
      "title": "'Reynolds' Bundles BYOVD With Ransomware Payload",
      "link": "https://www.darkreading.com/threat-intelligence/black-basta-bundles-byovd-ransomware-payload",
      "description": "Researchers discovered a newly disclosed vulnerable driver embedded in Reynolds' ransomware, illustrating the increasing popularity of the defense-evasion technique.",
      "date": "Mon, 09 Feb 2026 20:14:22 GMT",
      "category": "cybersecurity_news",
      "source": "https://www.darkreading.com/rss.xml"
    },
    {
      "title": "[Virtual Event] Shields Up: Key Technologies Reshaping Cybersecurity Defenses",
      "link": "https://www.darkreading.com/events/shields-up-key-technologies-reshaping-cybersecurity-defenses",
      "description": "",
      "date": "",
      "category": "cybersecurity_news",
      "source": "https://www.darkreading.com/rss.xml"
    },
    {
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "description": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "date": "Tue, 20 Jan 2026 18:19:13 +0000",
      "category": "cybersecurity_news",
      "source": "https://krebsonsecurity.com/feed/"
    },
    {
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "description": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "date": "Wed, 14 Jan 2026 00:47:38 +0000",
      "category": "cybersecurity_news",
      "source": "https://krebsonsecurity.com/feed/"
    },
    {
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "description": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "date": "Thu, 08 Jan 2026 23:23:43 +0000",
      "category": "cybersecurity_news",
      "source": "https://krebsonsecurity.com/feed/"
    },
    {
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "description": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "date": "Fri, 02 Jan 2026 14:20:10 +0000",
      "category": "cybersecurity_news",
      "source": "https://krebsonsecurity.com/feed/"
    },
    {
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "description": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "date": "Mon, 29 Dec 2025 20:23:26 +0000",
      "category": "cybersecurity_news",
      "source": "https://krebsonsecurity.com/feed/"
    },
    {
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "description": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "date": "Fri, 19 Dec 2025 15:14:55 +0000",
      "category": "cybersecurity_news",
      "source": "https://krebsonsecurity.com/feed/"
    },
    {
      "title": "Most Parked Domains Now Serving Malicious Content",
      "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
      "description": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
      "date": "Tue, 16 Dec 2025 14:14:48 +0000",
      "category": "cybersecurity_news",
      "source": "https://krebsonsecurity.com/feed/"
    },
    {
      "title": "Microsoft Patch Tuesday, December 2025 Edition",
      "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
      "description": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
      "date": "Tue, 09 Dec 2025 23:18:29 +0000",
      "category": "cybersecurity_news",
      "source": "https://krebsonsecurity.com/feed/"
    },
    {
      "title": "Drones to Diplomas: How Russia’s Largest Private University is Linked to a $25M Essay Mill",
      "link": "https://krebsonsecurity.com/2025/12/drones-to-diplomas-how-russias-largest-private-university-is-linked-to-a-25m-essay-mill/",
      "description": "A sprawling academic cheating network turbocharged by Google Ads that has generated nearly $25 million in revenue has curious connections to a Kremlin-connected oligarch whose Russian university builds drones for Russia's war against Ukraine.",
      "date": "Sat, 06 Dec 2025 14:45:03 +0000",
      "category": "cybersecurity_news",
      "source": "https://krebsonsecurity.com/feed/"
    },
    {
      "title": "SMS Phishers Pivot to Points, Taxes, Fake Retailers",
      "link": "https://krebsonsecurity.com/2025/12/sms-phishers-pivot-to-points-taxes-fake-retailers/",
      "description": "China-based phishing groups blamed for non-stop scam SMS messages about a supposed wayward package or unpaid toll fee are promoting a new offering, just in time for the holiday shopping season: Phishing kits for mass-creating fake but convincing e-commerce websites that convert customer payment card data into mobile wallets from Apple and Google. Experts say these same phishing groups also are now using SMS lures that promise unclaimed tax refunds and mobile rewards points.",
      "date": "Thu, 04 Dec 2025 23:02:34 +0000",
      "category": "cybersecurity_news",
      "source": "https://krebsonsecurity.com/feed/"
    },
    {
      "title": "AI-Generated Text and the Detection Arms Race",
      "link": "https://www.schneier.com/blog/archives/2026/02/the-ai-generated-text-arms-race.html",
      "description": "<p>In 2023, the science fiction literary magazine <cite>Clarkesworld</cite> <a href=\"https://www.npr.org/2023/02/24/1159286436/ai-chatbot-chatgpt-magazine-&#60;cite&#62;Clarkesworld&#60;/cite&#62;-artificial-intelligence\">stopped accepting</a> new submissions because so many were generated by artificial intelligence. Near as the editors could tell, many submitters pasted the magazine’s detailed story guidelines into an AI and sent in the results. And they weren’t alone. Other fiction magazines have also <a href=\"https://www.theverge.com/2023/2/25/23613752/ai-generated-short-stories-literary-magazines-&#60;cite&#62;Clarkesworld&#60;/cite&#62;-science-fiction\">reported a high number</a> of AI-generated submissions.</p>\n<p>This is only one example of a ubiquitous trend. A legacy system relied on the difficulty of writing and cognition to limit volume. Generative AI overwhelms the system because the humans on the receiving end can’t keep up...</p>",
      "date": "2026-02-11T05:51:18Z",
      "category": "cybersecurity_news",
      "source": "https://www.schneier.com/feed/atom/"
    },
    {
      "title": "LLMs are Getting a Lot Better and Faster at Finding and Exploiting Zero-Days",
      "link": "https://www.schneier.com/blog/archives/2026/02/llms-are-getting-a-lot-better-and-faster-at-finding-and-exploiting-zero-days.html",
      "description": "<p>This is <a href=\"https://red.anthropic.com/2026/zero-days/\">amazing</a>:</p>\n<blockquote><p>Opus 4.6 is notably better at finding high-severity vulnerabilities than previous models and a sign of how quickly things are moving. Security teams have been automating vulnerability discovery for years, investing heavily in fuzzing infrastructure and custom harnesses to find bugs at scale. But what stood out in early testing is how quickly Opus 4.6 found vulnerabilities out of the box without task-specific tooling, custom scaffolding, or specialized prompting. Even more interesting is how it found them. Fuzzers work by throwing massive amounts of random inputs at code to see what breaks. Opus 4.6 reads and reasons about code the way a human researcher would­&#8212;looking at past fixes to find similar bugs that weren&#8217;t addressed, spotting patterns that tend to cause problems, or understanding a piece of logic well enough to know exactly what input would break it. When we pointed Opus 4.6 at some of the most well-tested codebases (projects that have had fuzzers running against them for years, ...</p></blockquote>",
      "date": "2026-02-06T20:49:33Z",
      "category": "cybersecurity_news",
      "source": "https://www.schneier.com/feed/atom/"
    },
    {
      "title": "Friday Squid Blogging: Squid Fishing Tips",
      "link": "https://www.schneier.com/blog/archives/2026/02/friday-squid-blogging-squid-fishing-tips.html",
      "description": "<p>This is a <a href=\"https://www.youtube.com/watch?v=pNq_W2CkACU\">video</a> of advice for squid fishing in Puget Sound.</p>\n<p>As usual, you can also use this squid post to talk about the security stories in the news that I haven&#8217;t covered.</p>\n<p><a href=\"https://www.schneier.com/blog/archives/2024/06/new-blog-moderation-policy.html\">Blog moderation policy.</a></p>\n",
      "date": "2026-01-22T20:12:46Z",
      "category": "cybersecurity_news",
      "source": "https://www.schneier.com/feed/atom/"
    },
    {
      "title": "I Am in the Epstein Files",
      "link": "https://www.schneier.com/blog/archives/2026/02/i-am-in-the-epstein-files.html",
      "description": "<p><a href=\"https://www.jmail.world/thread/EFTA02451032?view=inbox\">Once</a>. Someone named &#8220;Vincenzo lozzo&#8221; wrote to Epstein in email, in 2016: &#8220;I wouldn&#8217;t pay too much attention to this, Schneier has a long tradition of dramatizing and misunderstanding things.&#8221; The topic of the email is DDoS attacks, and it is unclear what I am dramatizing and misunderstanding.</p>\n<p>Rabbi Schneier is also mentioned, also incidentally, also <a href=\"https://www.jmail.world/thread/EFTA02442876?view=inbox\">once</a>. As far as either of us know, we are not related.</p>\n<p>EDITED TO ADD (2/7): There is <a href=\"https://www.justice.gov/epstein/files/DataSet%209/EFTA00817090.pdf\">more context</a> on the Justice.gov website version.</p>\n",
      "date": "2026-02-07T14:44:35Z",
      "category": "cybersecurity_news",
      "source": "https://www.schneier.com/feed/atom/"
    },
    {
      "title": "iPhone Lockdown Mode Protects Washington Post Reporter",
      "link": "https://www.schneier.com/blog/archives/2026/02/iphone-lockdown-mode-protects-washington-post-reporter.html",
      "description": "<p>404Media is <a href=\"https://www.404media.co/fbi-couldnt-get-into-wapo-reporters-iphone-because-it-had-lockdown-mode-enabled/\">reporting</a> that the FBI could not access a reporter&#8217;s iPhone because it had Lockdown Mode enabled:</p>\n<blockquote><p>The court record shows what devices and data the FBI was able to ultimately access, and which devices it could not, after raiding the home of the reporter, Hannah Natanson, in January as part of an investigation into leaks of classified information. It also provides rare insight into the apparent effectiveness of Lockdown Mode, or at least how effective it might be before the FBI may try other techniques to access the device.</p>\n<p>&#8220;Because the iPhone was in Lockdown mode, CART could not extract that device,&#8221; the court record reads, referring to the FBI&#8217;s Computer Analysis Response Team, a unit focused on performing forensic analyses of seized devices. The document is written by the government, and is opposing the return of Natanson&#8217;s devices...</p></blockquote>",
      "date": "2026-02-05T17:03:50Z",
      "category": "cybersecurity_news",
      "source": "https://www.schneier.com/feed/atom/"
    },
    {
      "title": "Backdoor in Notepad++",
      "link": "https://www.schneier.com/blog/archives/2026/02/backdoor-in-notepad.html",
      "description": "<p>Hackers associated with the Chinese government used a <a href=\"https://arstechnica.com/security/2026/02/notepad-updater-was-compromised-for-6-months-in-supply-chain-attack/\">Trojaned version</a> of Notepad++ to deliver malware to selected users.</p>\n<blockquote><p>Notepad++ said that officials with the unnamed provider hosting the update infrastructure consulted with incident responders and found that it remained compromised until September 2. Even then, the attackers maintained credentials to the internal services until December 2, a capability that allowed them to continue redirecting selected update traffic to malicious servers. The threat actor &#8220;specifically targeted Notepad++ domain with the goal of exploiting insufficient update verification controls that existed in older versions of Notepad++.&#8221; Event logs indicate that the hackers tried to re-exploit one of the weaknesses after it was fixed but that the attempt failed...</p></blockquote>",
      "date": "2026-02-05T04:02:12Z",
      "category": "cybersecurity_news",
      "source": "https://www.schneier.com/feed/atom/"
    },
    {
      "title": "US Declassifies Information on JUMPSEAT Spy Satellites",
      "link": "https://www.schneier.com/blog/archives/2026/02/us-declassifies-information-on-jumpseat-spy-satellites.html",
      "description": "<p>The US National Reconnaissance Office has declassified <a href=\"https://arstechnica.com/space/2026/01/us-spy-satellite-agency-declassifies-high-flying-cold-war-listening-post/\">information</a> about a fleet of spy satellites operating between 1971 and 2006.</p>\n<p>I&#8217;m actually impressed to see a declassification only two decades after decommission.</p>\n",
      "date": "2026-02-03T17:04:40Z",
      "category": "cybersecurity_news",
      "source": "https://www.schneier.com/feed/atom/"
    },
    {
      "title": "Microsoft is Giving the FBI BitLocker Keys",
      "link": "https://www.schneier.com/blog/archives/2026/02/microsoft-is-giving-the-fbi-bitlocker-keys.html",
      "description": "<p>Microsoft <a href=\"https://www.forbes.com/sites/thomasbrewster/2026/01/22/microsoft-gave-fbi-keys-to-unlock-bitlocker-encrypted-data/\">gives</a> the FBI the ability to decrypt BitLocker in response to court orders: about twenty times per year.</p>\n<blockquote><p>It&#8217;s possible for users to store those keys on a device they own, but Microsoft also recommends BitLocker users store their keys on its servers for convenience. While that means someone can access their data if they forget their password, or if repeated failed attempts to login lock the device, it also makes them vulnerable to law enforcement subpoenas and warrants.</p></blockquote>\n",
      "date": "2026-02-02T17:08:53Z",
      "category": "cybersecurity_news",
      "source": "https://www.schneier.com/feed/atom/"
    },
    {
      "title": "AI Coding Assistants Secretly Copying All Code to China",
      "link": "https://www.schneier.com/blog/archives/2026/02/ai-coding-assistants-secretly-copying-all-code-to-china.html",
      "description": "<p>There&#8217;s a <a href=\"https://www.koi.ai/blog/maliciouscorgi-the-cute-looking-ai-extensions-leaking-code-from-1-5-million-developers\">new report</a> about two AI coding assistants, used by 1.5 million developers, that are surreptitiously sending a copy of everything they ingest to China.</p>\n<p>Maybe avoid using them.</p>\n",
      "date": "2026-01-30T15:38:11Z",
      "category": "cybersecurity_news",
      "source": "https://www.schneier.com/feed/atom/"
    },
    {
      "title": "Friday Squid Blogging: New Squid Species Discovered",
      "link": "https://www.schneier.com/blog/archives/2026/01/friday-squid-blogging-new-squid-species-discovered.html",
      "description": "<p>A <a href=\"https://www.livescience.com/animals/mollusks/very-novel-and-very-puzzling-unknown-species-of-squid-spotted-burying-itself-upside-down-pretending-to-be-a-plant\">new species of squid</a>. pretends to be a plant:</p>\n<blockquote><p>Scientists have filmed a never-before-seen species of deep-sea squid burying itself upside down in the seafloor&#8212;a behavior never documented in cephalopods. They captured the bizarre scene while studying the depths of the Clarion-Clipperton Zone (CCZ), an abyssal plain in the Pacific Ocean targeted for deep-sea mining.</p>\n<p>The team described the encounter in a study published Nov. 25 in the journal <a href=\"https://esajournals.onlinelibrary.wiley.com/doi/10.1002/ecy.70257\"><i>Ecology</i></a>, writing that the animal appears to be an undescribed species of whiplash squid. At a depth of roughly 13,450 feet (4,100 meters), the squid had buried almost its entire body in sediment and was hanging upside down, with its siphon and two long ...</p></blockquote>",
      "date": "2026-01-22T20:09:13Z",
      "category": "cybersecurity_news",
      "source": "https://www.schneier.com/feed/atom/"
    },
    {
      "title": "Safeguarding and Securing Cyberspace",
      "link": "https://www.cisa.gov/news-events/news/safeguarding-and-securing-cyberspace",
      "description": "",
      "date": "Wed, 20 Jul 11 12:00:00 +0000",
      "category": "cybersecurity_news",
      "source": "https://www.cisa.gov/news.xml"
    },
    {
      "title": "DHS Holds Classified Briefing for Private Sector Election Companies",
      "link": "https://www.cisa.gov/news-events/news/dhs-holds-classified-briefing-private-sector-election-companies",
      "description": "Senior officials from the U.S. Department of Homeland Security (DHS) met today with members of the Sector Coordinating Council (SCC) for the Election Infrastructure Subsector and conducted a classified briefing on the current cyber threat landscape for the election community.&nbsp;",
      "date": "Tue, 02 Oct 18 12:00:00 +0000",
      "category": "cybersecurity_news",
      "source": "https://www.cisa.gov/news.xml"
    },
    {
      "title": "DHS and Private Sector Partners Establish Information and Communications Technology Supply Chain Risk Management Task Force",
      "link": "https://www.cisa.gov/news-events/news/dhs-and-private-sector-partners-establish-information-and-communications",
      "description": "The U.S. Department of Homeland Security (DHS) announced today the formation and chartering of the nation’s first Information and Communications Technology (ICT) Supply Chain Risk Management Task Force, a public-private partnership to examine and develop consensus recommendations to identify and manage risk to the global ICT supply chain.&nbsp;",
      "date": "Tue, 30 Oct 18 12:00:00 +0000",
      "category": "cybersecurity_news",
      "source": "https://www.cisa.gov/news.xml"
    },
    {
      "title": "DHS Announces ICT Supply Chain Risk Management Task Force Members",
      "link": "https://www.cisa.gov/news-events/news/dhs-announces-ict-supply-chain-risk-management-task-force-members",
      "description": "The Department of Homeland Security (DHS) hosted the inaugural meeting of the nation’s first Information and Communications Technology (ICT) Supply Chain Risk Management Task Force. The task force is a public-private partnership formed to examine and develop consensus recommendations to identify and manage risk to the global ICT supply chain.",
      "date": "Thu, 15 Nov 18 12:00:00 +0000",
      "category": "cybersecurity_news",
      "source": "https://www.cisa.gov/news.xml"
    },
    {
      "title": "Statement from CISA Director Krebs on Election Security",
      "link": "https://www.cisa.gov/news-events/news/statement-cisa-director-krebs-election-security",
      "description": "Cybersecurity and Infrastructure Security Agency (CISA) Director Christopher C. Krebs released the following statement today on the agency’s election security work.",
      "date": "Thu, 14 Feb 19 12:00:00 +0000",
      "category": "cybersecurity_news",
      "source": "https://www.cisa.gov/news.xml"
    },
    {
      "title": "CISA’s ICT Supply Chain Risk Management Task Force Launches Work Streams",
      "link": "https://www.cisa.gov/news-events/news/cisas-ict-supply-chain-risk-management-task-force-launches-work-streams",
      "description": "WASHINGTON – The Cybersecurity and Infrastructure Security Agency (CISA) and government and industry members of the Information and Communications Technology (ICT) Supply Chain Risk Management Task Force gathered in Washington this week and last week as part of the Task Force’s o",
      "date": "Tue, 26 Feb 19 12:00:00 +0000",
      "category": "cybersecurity_news",
      "source": "https://www.cisa.gov/news.xml"
    },
    {
      "title": "CISA Partners with Secure Community Network to Hold Incident Response Exercise",
      "link": "https://www.cisa.gov/news-events/news/cisa-partners-secure-community-network-hold-incident-response-exercise",
      "description": "WASHINGTON – Yesterday, the Cybersecurity and Infrastructure Security Agency (CISA) hosted a tabletop exercise in collaboration with the Secure Community Network (SCN). The exercise brought together Jewish community leaders from across the nation, along with federal and state law enforcement and interagency partners to examine how they would act in a notional event focused on threats of violence including scenarios based on current events.",
      "date": "Wed, 10 Apr 19 12:00:00 +0000",
      "category": "cybersecurity_news",
      "source": "https://www.cisa.gov/news.xml"
    },
    {
      "title": "CISA Releases National Critical Functions Set",
      "link": "https://www.cisa.gov/news-events/news/cisa-releases-national-critical-functions-set",
      "description": "The Department of Homeland Security’s Cybersecurity and Infrastructure Security Agency (CISA) today released the inaugural set of National Critical Functions. &nbsp;These are functions used or supported by government and the private sector that are of such vital importance to the United States that their disruption, corruption, or dysfunction would have a debilitating effect on security, national economic security, national public health or safety, or any combination thereof.",
      "date": "Tue, 30 Apr 19 12:00:00 +0000",
      "category": "cybersecurity_news",
      "source": "https://www.cisa.gov/news.xml"
    },
    {
      "title": "CISA’s ICT Supply Chain Risk Management Task Force Makes Key Acquisition Recommendation",
      "link": "https://www.cisa.gov/news-events/news/cisas-ict-supply-chain-risk-management-task-force-makes-key-acquisition",
      "description": "The Cybersecurity and Infrastructure Security Agency (CISA) and government and industry members of the Information and Communications Technology (ICT) Supply Chain Risk Management Task Force gathered in Washington, D.C. today to update members on progress towards the development of an initial recommendation to help industry and government stakeholders more effectively identify and manage risks to global ICT supply chains.&nbsp;",
      "date": "Thu, 20 Jun 19 12:00:00 +0000",
      "category": "cybersecurity_news",
      "source": "https://www.cisa.gov/news.xml"
    },
    {
      "title": "CISA Statement on Iranian Cybersecurity Threats",
      "link": "https://www.cisa.gov/news-events/news/cisa-statement-iranian-cybersecurity-threats",
      "description": "In response to reports of an increase in cybersecurity threats, the Department of Homeland Security’s (DHS) Cybersecurity and Infrastructure Security Agency (CISA) Director Christopher C. Krebs issued the following statement:“CISA is aware of a recent rise in malicious cyber activity directed at United States industries and government agencies by Iranian regime actors and proxies. We will continue to work with our intelligence community and cybersecurity partners to monitor Iranian cyber activity, share information, and take steps to keep America and our allies safe.",
      "date": "Sat, 22 Jun 19 12:00:00 +0000",
      "category": "cybersecurity_news",
      "source": "https://www.cisa.gov/news.xml"
    },
    {
      "title": "Mentorship Monday - Post All Career, Education and Job questions here!",
      "link": "https://www.reddit.com/r/cybersecurity/comments/1qzp0vu/mentorship_monday_post_all_career_education_and/",
      "description": "",
      "date": "2026-02-09T00:00:32+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/cybersecurity/.rss"
    },
    {
      "title": "How concerned should we be about Discord's new age verification.",
      "link": "https://www.reddit.com/r/cybersecurity/comments/1r1oi54/how_concerned_should_we_be_about_discords_new_age/",
      "description": "",
      "date": "2026-02-11T05:12:58+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/cybersecurity/.rss"
    },
    {
      "title": "Where is AI actually making a real difference in cybersecurity operations today?",
      "link": "https://www.reddit.com/r/cybersecurity/comments/1r1oqpu/where_is_ai_actually_making_a_real_difference_in/",
      "description": "",
      "date": "2026-02-11T05:25:20+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/cybersecurity/.rss"
    },
    {
      "title": "OMEMO/Open PGP",
      "link": "https://www.reddit.com/r/cybersecurity/comments/1r1qxd0/omemoopen_pgp/",
      "description": "",
      "date": "2026-02-11T07:28:13+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/cybersecurity/.rss"
    },
    {
      "title": "Security analysts, what's your biggest time sink outside actual security work?",
      "link": "https://www.reddit.com/r/cybersecurity/comments/1r1cctp/security_analysts_whats_your_biggest_time_sink/",
      "description": "",
      "date": "2026-02-10T20:35:27+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/cybersecurity/.rss"
    },
    {
      "title": "Andrew Morris finds iOS AdGuard is written by Russians and injects 20K lines into your browser",
      "link": "https://www.reddit.com/r/cybersecurity/comments/1r0q6oq/andrew_morris_finds_ios_adguard_is_written_by/",
      "description": "",
      "date": "2026-02-10T03:45:04+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/cybersecurity/.rss"
    },
    {
      "title": "135,000+ OpenClaw instances exposed to the internet, 63% vulnerable, and the fix they just announced isn't going to cut it",
      "link": "https://www.reddit.com/r/cybersecurity/comments/1r16yb4/135000_openclaw_instances_exposed_to_the_internet/",
      "description": "",
      "date": "2026-02-10T17:23:08+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/cybersecurity/.rss"
    },
    {
      "title": "40,000+ AI Agents Exposed to the Internet with Full System Access",
      "link": "https://www.reddit.com/r/cybersecurity/comments/1r0xzcg/40000_ai_agents_exposed_to_the_internet_with_full/",
      "description": "",
      "date": "2026-02-10T11:12:29+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/cybersecurity/.rss"
    },
    {
      "title": "seqra/seqra: Security-focused static analyzer for Java and Kotlin web applications",
      "link": "https://www.reddit.com/r/cybersecurity/comments/1r1r7wi/seqraseqra_securityfocused_static_analyzer_for/",
      "description": "",
      "date": "2026-02-11T07:46:21+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/cybersecurity/.rss"
    },
    {
      "title": "What's the actual risk of typosquatting attacks in 2026?",
      "link": "https://www.reddit.com/r/cybersecurity/comments/1r1iuew/whats_the_actual_risk_of_typosquatting_attacks_in/",
      "description": "",
      "date": "2026-02-11T00:50:17+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/cybersecurity/.rss"
    },
    {
      "title": "Help us build the SCA FAQ",
      "link": "https://www.reddit.com/r/SecurityCareerAdvice/comments/ay7ugv/help_us_build_the_sca_faq/",
      "description": "",
      "date": "2019-03-07T03:12:56+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/SecurityCareerAdvice/.rss"
    },
    {
      "title": "Certs, Degrees, and Experience: A (hopefully) useful guide to common questions",
      "link": "https://www.reddit.com/r/SecurityCareerAdvice/comments/b9r05z/certs_degrees_and_experience_a_hopefully_useful/",
      "description": "",
      "date": "2019-04-05T13:08:41+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/SecurityCareerAdvice/.rss"
    },
    {
      "title": "Apprenticeship in the space",
      "link": "https://www.reddit.com/r/SecurityCareerAdvice/comments/1r1m5dc/apprenticeship_in_the_space/",
      "description": "",
      "date": "2026-02-11T03:18:09+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/SecurityCareerAdvice/.rss"
    },
    {
      "title": "Stuck at tier 1",
      "link": "https://www.reddit.com/r/SecurityCareerAdvice/comments/1r1b8t6/stuck_at_tier_1/",
      "description": "",
      "date": "2026-02-10T19:55:51+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/SecurityCareerAdvice/.rss"
    },
    {
      "title": "Senior IT/Cloud/Fintech leader w/ MS Cybersecurity + CISSP/CISM/CISA - screened out for “no cyber experience.” What bridge roles are actually working?",
      "link": "https://www.reddit.com/r/SecurityCareerAdvice/comments/1r1jykk/senior_itcloudfintech_leader_w_ms_cybersecurity/",
      "description": "",
      "date": "2026-02-11T01:39:53+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/SecurityCareerAdvice/.rss"
    },
    {
      "title": "Is CCSP even valuable?",
      "link": "https://www.reddit.com/r/SecurityCareerAdvice/comments/1r1abt2/is_ccsp_even_valuable/",
      "description": "",
      "date": "2026-02-10T19:22:48+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/SecurityCareerAdvice/.rss"
    },
    {
      "title": "Is IDC IT Technician a good role for experience to help me break into cybersecurity?",
      "link": "https://www.reddit.com/r/SecurityCareerAdvice/comments/1r128x3/is_idc_it_technician_a_good_role_for_experience/",
      "description": "",
      "date": "2026-02-10T14:30:13+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/SecurityCareerAdvice/.rss"
    },
    {
      "title": "Please tell me how i can improve my resume.",
      "link": "https://www.reddit.com/r/SecurityCareerAdvice/comments/1r0vlfy/please_tell_me_how_i_can_improve_my_resume/",
      "description": "",
      "date": "2026-02-10T08:45:24+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/SecurityCareerAdvice/.rss"
    },
    {
      "title": "Starting SOC (new guy)",
      "link": "https://www.reddit.com/r/SecurityCareerAdvice/comments/1r17h9x/starting_soc_new_guy/",
      "description": "",
      "date": "2026-02-10T17:42:02+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/SecurityCareerAdvice/.rss"
    },
    {
      "title": "Created Awesome AppSec Interview - prep guide",
      "link": "https://www.reddit.com/r/SecurityCareerAdvice/comments/1r0hibq/created_awesome_appsec_interview_prep_guide/",
      "description": "",
      "date": "2026-02-09T21:40:36+00:00",
      "category": "career_news",
      "source": "https://www.reddit.com/r/SecurityCareerAdvice/.rss"
    }
  ],
  "trending": [
    [
      "AI",
      28
    ],
    [
      "OT",
      23
    ],
    [
      "government",
      8
    ],
    [
      "SOC",
      5
    ],
    [
      "ransomware",
      5
    ],
    [
      "vulnerability",
      4
    ],
    [
      "zero-day",
      4
    ],
    [
      "supply chain",
      4
    ],
    [
      "engineer",
      2
    ],
    [
      "breach",
      2
    ]
  ],
  "fetch_date": "February 2026"
}